Tekla Open API Reference for Tekla Structures 2025
LoadLine.P1 Property
 The load magnitude vector at the start position. The values are given in the local coordinate system of the load (not in the current coordinate system).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector P1 { get; set; }
Public Property P1 As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
LoadLine Class
Tekla.Structures.Model Namespace